{
    "title": "Strategies",
    "explanation": [ {
        "heading": "Seals and Tidying off Black Metal Dragon and Chamber",
        "image": "Beep",
        "info": "This combo revolves around having <span class='emphasis'>Black Metal Dragon</span> and <span class='emphasis'>Chamber Dragonmaid</span> in your hand and lets you end on a board of <span class='emphasis'>Hieratic Seals of the Heavenly Spheres</span> and <span class='emphasis'>Dragonmaid Tidying</span>.<br><br>To begin, you start off by summoning <span class='emphasis'>Black Metal Dragon</span>. Then, you link <span class='emphasis'>Black Metal Dragon</span> off to summon <span class='emphasis'>Striker Dragon</span> from your Extra Deck. This sends <span class='emphasis'>Black Metal Dragon</span> to the graveyard, allowing you to activate its effect in order to add a <span class='emphasis'>Red-Eyes Darkness Metal Dragon</span> from your deck to your hand (if you already have it in your hand, you can simply skip the <span class='emphasis'>Striker Dragon</span> summon).<br><br>You then banish <span class='emphasis'>Striker Dragon</span> in order to Special Summon <span class='emphasis'>Red-Eyes Darkness Metal Dragon</span> to the field as per its summoning requirements. After this, you can activate the effect of <span class='emphasis'>Red-Eyes Darkness Metal Dragon</span> in order to Special Summon <span class='emphasis'>Chamber Dragonmaid</span> from your hand, thereby activating her effect in order to search for a 'Dragonmaid' spell or trap card from your deck and add it to your hand. This is how you search out <span class='emphasis'>Dragonmaid Tidying</span>.<br><br>Finally, you use both <span class='emphasis'>Red-Eyes Darkness Metal Dragon</span> and <span class='emphasis'>Chamber Dragonmaid</span> in order to Special Summon <span class='emphasis'>Hieratic Seals of the Heavenly Spheres</span> to your Extra Monster Zone, before setting <span class='emphasis'>Dragonmaid Tidying</span> to the field as well.<br><br>This line gives you access to two disruptions in the form of Seals and Tidying, with Seals allowing you to summon <span class='emphasis'>Nurse Dragonmaid</span> whose effect lets you summon back <span class='emphasis'>Chamber Dragonmaid</span> from your graveyard. You can then use <span class='emphasis'>Chamber Dragonmaid's</span> effect in order to grab another spell card from your deck for your next turn."
    } ]
}
